Enums/ИгровыеСхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИгровыеСхемы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Схема4231</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Схема442</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Схема442Ромб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Схема433</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Схема352</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Схема343</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/Интерфейс/Ext/Module.bsl
#Область ПрограмныйИнтерфейс

Функция ИзображениеТактическойСхемы(Схема) Экспорт

	Если Схема = Перечисления.ИгровыеСхемы.Схема343 Тогда
		Возврат БиблиотекаКартинок.Схема343;
	ИначеЕсли Схема = Перечисления.ИгровыеСхемы.Схема352 Тогда
		Возврат БиблиотекаКартинок.Схема352;
	ИначеЕсли Схема = Перечисления.ИгровыеСхемы.Схема4231 Тогда  
		Возврат БиблиотекаКартинок.Схема4231;
	ИначеЕсли Схема = Перечисления.ИгровыеСхемы.Схема433 Тогда
		Возврат БиблиотекаКартинок.Схема433;
	ИначеЕсли Схема = Перечисления.ИгровыеСхемы.Схема442 Тогда     
		Возврат БиблиотекаКартинок.Схема442;
	ИначеЕсли Схема = Перечисления.ИгровыеСхемы.Схема442Ромб Тогда
		Возврат БиблиотекаКартинок.Схема442Ромб;
	Иначе
		Возврат Новый Картинка;
	КонецЕсли;

КонецФункции 

#КонецОбласти
